import { StyleSheet, Text, View,ScrollView} from 'react-native'
import React from 'react'

const GenjaGuide = () => {
  return (
    <ScrollView style={{marginBottom:10,flex:1,}}>
      <Text style={{color:'blue',textAlign:'center',padding:10,fontSize:20,}}>གན་རྒྱ།</Text>
      <Text  style={{paddingLeft:10,}}>ན་རྒྱ་ཟེརར་མི་་འདི་་ ཅ་ལ་རེ་་ཉོོ་བཙོངང་འཐབ་པའི་་སྐབས་དང་ གཉེན་བསྡོོམ་ནི་་དང་ ཁ་འབྱལ་ནི་་ སྐལཝ་བགོོ་ བཤའ་སྤྲོོད་ལེནན་འབད་བའི་་སྐབས་ལུ་ 
          མི་་གཉིས་(རྩ་བོོ་ཕན་ཚུན)ཀྱི་་བར་ན་ འཛོམས་དཔང་བཙུགས་ཏེ་་
          བཟོོ་མི་་ཡི་་གུ་འདི་་ལུ་སླབ་ཨིནན།</Text>
       <Text style={{paddingLeft:10,}}>
       གན་རྒྱ བཟོོ་མི་་འདི་་ ཁྲིམས་ལུགས་ཀྱི་་སྐོོར་ལས་ ཧ་གོོ་མི་་ཅིག་གིསས་བཟོོ་དགོོཔ་ཨིནན། དཔེརར་ན། གན་རྒྱ་འདི་་
བཟའ་ཚང་ཡ་བྲལ་གྱི་་སྐོོར་ལས་ཨིནན་པ་ཅིན་ གན་རྒྱ་བཟོོ་མི་་འདི་་གིསས་ བཟའ་ཚང་ཡ་བྲལ་གྱི་་ཁྲིམས་ལུགས་ཚུ་
ན་འཐན་འབད་ དབྱེ་་བ་དཔྱད་ཞིནནམ་ད་ དེ་་ལས་ཚིག་དོོན་དེ་་ཚུ་ ཁྲིམས་ཡིགག་དང་འཁྲིལ་ཏེ་་ བཟོོ་དགོོ་པའི་་ཁར་ འབའ་གན་རྒྱ་ཚུ་ཡང་ དེ་་དང་འཁྲིལ་ཏེ་་བཀོོད་དགོོ།
           </Text>
           <Text style={{color:'blue',padding:10}}>
           གན་རྒྱ་འབྲིིཝ་ད་ ཚང་དགོོ་པའི་་གནད་དོོན།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༡.	 གན་རྒྱའི་་རིགས་ག་ཅི་་ར་བྲི་་རུང་ གནད་དོོན་གཙོ་་བོོར་བཏོོན་དགོོཔ་ཨིནན།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༢.	 གན་རྒྱའི་་རིགས་འབྲི་་སྐབས་ གང་ཟག་གསུམ་པའི་་ དབང་ལུ་བཏང་སྟེ་་ བྲི་་དགོོ་པའི་་ཁར་རྗོོད་བྱེདད་
          ཚིག་གི་་རྒྱན་དང་ གབ་ཚིག་རྩ་ལས་མ་བཙུགས་པར་ དོོན་དག་གསལ་ཏོོག་ཏོོ་འབད་བྲི་་དགོོ།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༣.	 གན་རྒྱའི་་རྗོོད་ཚིག་ཚུ་ གཙོ་་བོོ་རང་གི་་རྒྱལ་ཁབ་ཀྱི་་ལམ་ལུགས་དང་ ཁྲིམས་ལུགས་ཚུ་དང་འཁྲིལ་ཏེ་
            བཟོོ་དགོོཔ་ཨིནན།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༤.	 གན་རྒྱ་བཟོོ་དགོོ་པའི་་དམིགགས་ཡུལ་གྱི་་གནད་དོོན་ལུ་ ཕོོག་དང་མི་་ཕོོག་ དེ་་ལས་ཚིག་གིསས་དངོོས་སུ་
            ཟིནན་པ་དང་ མ་ཟིནན་པའི་་ཤུགས་ཀྱིསས་ འཕྲལ་ཕུགས་གཉིས་ལུ་གནོོད་ཉེན་དང་ ཕན་ཐབས་ག་དེ་་སྦེ་་
            ཡོོད་ག་ དེ་་ཚུ་ལེགགས་ཤོོམ་འབད་བལྟ་སྟེ་་བཟོོ་དགོོ།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༥.	 གན་རྒྱ་བཟོ་བའི་སྐབས་ སྤྱི་ལོ་དང་ གནམ་ལོ་ཟླ་ཚེས་ཚུ་ ཁ་གསལ་བཀོད་དགོ།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༦.	 གན་རྒྱའི་ནང་བཀོད་ནིའི་ དོན་ཚན་ལེ་ཤ་ཡོད་པ་ཅིན་ དོན་ཚན་ཆེ་ཆུང་ག་ཅི་བཟུམ་ཨིན་རུང་ དོན་ཚན་
          རེ་རེ་བཞིན་ལུ་ ཨང་རྟགས་སོ་སོ་ བཀོད་དེ་བྲི་དགོ་ནི་དང་། ཡང་ན་ དོན་མཚམས་བཅད་དེ་ བྲི་དགོ།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༧.	 སྐྱིན་འགྲུལ་དང་ ས་གཞི་བགོ་ཐུན་ ཁང་གླ་ཚུ་གི་གན་རྒྱའི་ནང་ བདོག་གཏད་བཙུགས་དགོཔ་ཡོད་པ་
          ཅིན་ དེ་དང་ ལོ་ཚད་ཚུ་ ཁ་གསལ་ཚུད་དགོ།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༨.	 གན་རྒྱ་འདི་ལུ་ གལ་སྲིད་ཤུལ་མ་ ཆ་གནས་མ་འབད་བ་ཅིན་ བྱ་སྟབས་མ་བདེཝ་ཚུ་ ག་དེ་བསལ་
        ནི་ཨིན་ན་ དེ་ཚུ་སེལ་ཐབས་ཀྱི་ན་ཚིག་ཚུ་ ག་ར་ཁ་གསལ་འབད་བཙུགས་དགོ་ནི་དང་ འབའ་ཚིག་ཚུ་
        ཡང་ངེས་པར་བཙུགས་དགོ།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༩.	 གན་རྒྱའི་ནང་རྩ་ཕན་གཉིས་ལུ་ རྒྱབ་མི་རེ་དང་ སྤྱི་མཐུན་གྱི་འཛོམས་དཔང་གཉིས་ལས་མ་ཉུངམ་
            ཅིག་ཡོད་པ་ཅིན་ལེགས་ཤོམ་ཨིན། དེ་མིན་ གནད་དོན་འདི་ནང་ ཁེ་རྒུད་རེག་གཏོགས་ མེད་པའི་
            འཛོམས་དཔང་ཅིག་ངེས་པར་དགོ།
           </Text>
           <Text style={{paddingLeft:10,}}>
           ༡༠.	 གན་རྒྱ་བཟོ་ཚར་བའི་མཇུག་ལུ་ ཁྲིམས་རྟགས་སྦྱར་དགོ་ནི་དང་ རྩ་བོ་ཕན་ཚུན་གཉིས་ཀྱི་ ས་ཡིག་
        དང་ ལག་རྗེས་གང་རུང་ངེས་པར་བཀོད་དགོ་པའི་ཁར་ རྩ་ཕན་གཉིས་ཀྱི་རྒྱབ་མི་དང་ འཛོམས་དཔང་
        ཚུ་གི་མིང་དང་ ལག་རྗེས་ཚུ་ཡང་ངེས་པར་བཀོད་དགོ།
           </Text>
           <Text style={{paddingLeft:10,marginBottom:20}}>
           ༡༡. རྩ་ཕན་གཉིས་དང་ རྒྱབ་མི་ དཔང་པོ་ཚུ་གི་ ངོ་སྤྲོད་ལག་ཁྱེར་ཨང་ངེས་པར་དུ་བཀོད་དགོ།
           </Text>

           <View>
               <Text style={{color:'blue',textAlign:'center',fontSize:20,fontWeight:'bold',marginBottom:20,}}>གན་རྒྱའི་དཔེ།</Text>
               <Text style={{paddingLeft:10,paddingBottom:10,}}>༉	 ད་ལན་ རང་ལུགས་གནམ་ལོ་མེ་ཕོ་ཁྱི་ལོ་ཟླ་4པའི་ཚེས་༡༧དང་ དབྱིན་ཚེས་༡༣.༧.༢༠༠༦ལུ་
    སྤ་རོ་ཆ་འདུས་ཝང་ཅང་རྒེད་འོག་གཡུས་འུ་ཆུ་ལས་མི་ཁུངས་ངོ་སྤྲོད་ལག་ཁྱེར་ཨང་༠༠༠༠༠༠༠༠༠༠༠ཅན་
    མ་འཆང་མི་ ངོམ་བཀྲ་ཤིས་ཀྱིས་ ཅང་སྣང་དཀར་ལས་ ངོ་སྤྲོད་ལག་ཁྱེར་ཨང་༠༠༠༠༠༠༠༠༠༠༠ཅན་མ་
    འཆང་མི་ ངོམ་ དོན་གྲུབ་ལས་ དངུལ་ཀྲམ་༢༠༠,༠༠༠/-(འབུམ་གཉིས་) སྐྱིན་འགྲུལ་ལེན་ཡོདཔ་ཨིན།</Text>
    <Text style={{paddingLeft:10,paddingBottom:10,}}>
    སྐྱིན་འགྲུལ་འདི་ ལོ་འཁོར་ལུ་ དངུལ་ཀྲམ་སྟོང་ཕྲག་རེ་ལུ་ སྐྱེད་ཏི་རུ་༡༥ རེའི་རྩིས་འབད་ ལོ་ངོ་༡ ལུ་
    སྐྱེད་ཏི་རུ་༣༠,༠༠༠/- (སྟོང་ཕྲག་སུམ་ཅུ་) ཐམ་པ་སྤྲོད་དགོཔ་ཨིན། ངོ་སྐྱེད་བསྡོམས་དངུལ་ཀྲམ་
    ༢༣༠,༠༠༠/-(ཉིས་འབུམ་སུམ་ཁྲི་) ཐམ་པ་དེ་ སང་ཕོད་དབྱིན་ཚེས་༡༣.༧.༢༠༠༧ ལུ་ སྤྲོད་དགོཔ་
    ཨིན།
    </Text>
    <Text style={{paddingLeft:10,paddingBottom:10,}}>
    ག་དེམ་ཅིག་འབད་ གོང་གི་ཁ་དོན་ཆོད་ཡོད་པའི་ཁ་ཚིག་ལས་ རྒྱབ་འགལ་རེ་ཞུགས་ན་ འབའ་དང་ཉེས་ཁྲིམས་
    གཞུང་གི་ ཁྲིམས་ལུགས་ལྟར་ ཕྱག་ཞུ་ནི་ལུ་ཁས་ལེན་གྲུབ་པའི་ གན་འཛིན་ལུ།
    </Text>
      <View style={{flexDirection:'row',justifyContent:'space-around'}}>
          <Text>༡ སྐྱིན་འགྲུལ་བྱིན་མི་ དོན་གྲུབ་ཀྱི་རྟགས།</Text>
          <Text>༢ དེའི་རྒྱབ་མི་་་་་་་་་་་་་་རྟགས།</Text>
      </View>
      <View style={{flexDirection:'row',justifyContent:'space-around'}}>
          <Text>༣ སྐྱིན་འགྲུལ་ལེན་མི་ བཀྲ་ཤིས་ཀྱི་རྟགས།</Text>
          <Text>༤ དེའི་རྒྱབ་མི་་་་་་་་་་་་རྟགས།</Text>
      </View>
      <View style={{marginLeft:35,marginBottom:10,}}>
      <Text>༥ སྤྱི་མཐུན་གྱི་དཔང་པོ་ དངོས་གྲུབ་རྡོ་རྗེའི་རྟགས།</Text>
      </View>
   

           </View>
    </ScrollView>
  )
}

export default GenjaGuide

const styles = StyleSheet.create({})