import { StyleSheet, Text, View } from 'react-native'
import React from 'react'

const KajaGuide = () => {
  return (
    <View>
        <Text style={{color:'blue',fontSize:18,fontWeight:'bold',padding:15,textAlign:'center'}}>བཀའ་རྒྱ།</Text>
      <Text style={{paddingLeft:10,}}>བཀའ་རྒྱ་ཟེར་མི་འདི་ གོང་མ་གིས་ འོག་མ་ལུ་ འབད་དགོཔ་བཅའ་དགོཔ་ཚུ་གི་སྐོར་ལས་ བཀོད་རྒྱ་དང་ བརྡ་ སྐུལ་ ཡང་ན་ འབད་ཆོགཔ་དང་ མ་ཆོག་པའི་སྐོར་ལས་ གནང་བ་བྱིན་མི་ཡིག་རིགས་ལུ་སླབ་ཨིན། དེ་ལུ་ཧེ་
མ་འབདན་ བཀའ་ཤོག་ཟེར་སླབ་ཨིན་རུང་ བཀའ་ཤོག་དང་བཀའ་རྒྱའི་དབྱེ་བ་འདི་ དང་པ་འབྲི་ཐངས་ལམ་
ལུགས་ གཉིས་པ་ ཚིག་གཞི་བཙུགས་ཐངས་ གསུམ་པ་ཁྱབ་དབང་གི་ཁྱད་པར་ཚུ་ཡོདཔ་ཨིན།</Text>
<Text style={{paddingLeft:10,paddingVertical:10,}}>དེ་འབད་ནི་དེ་གིས་ བཀའ་ཤོག་ཟེར་མི་འདི་ གོངམ་རྒྱལ་བློན་ཚུ་གིས་ གནང་མི་དང་ དེ་ཚུ་གི་ཁྱད་ཚབ་ལུ་
མངགས་ཏེ་གནང་བའི་དབང་ཚད་ཅན་ཚུ་དང་ དེ་ལས་རྒྱལ་ཁབ་དང་ གཞུང་གི་མཐའ་དོན་ལུ་ གནང་མི་གི་
རིགས་ལུ་ བཀའ་ཤོག་ཟེར་ཞུ་ནི།</Text>
<Text style={{paddingLeft:10,}}>
ེ་མིན་པའི་གཞན་ ཡིག་ཚང་གི་བདག་སྐྱོང་དང་ འཛིན་སྐྱོང་གི་ལཱ་རིགས་དོན་ལུ་ གནང་མི་ལུ་བཀའ་རྒྱ་ཟེར་ སླབ་ནི་ཨིནམ་ལས་
 དེ་གི་ དཔེ་དག་པ་ཅིག་ འོག་ལུ་བཀོད་དེ་ཡོད་མི་ལུ་དབྱེ་དཔྱད་འབད་དེ་ སྦྱང་བ་འབད་དགོ། 
</Text>
<Text style={{color:'blue',fontSize:18,fontWeight:'bold',padding:15,}}>ཡིག་ཚང་བཀའ་རྒྱ་གི་དཔེ།</Text>
<View style={{flexDirection:'row',justifyContent:'space-around'}}>
    <Text>ཡིག་ཨང་----------</Text>
    <Text>ྤྱི་ཚེས་ ----------</Text>
</View>
<Text style={{textAlign:'center'}}> ཡིག་ཚང་བཀའ་རྒྱ།</Text>
<Text style={{paddingLeft:10,paddingVertical:10}}>ད་རེས་ གཞལམ་སྒང་རྫོང་ཁག་འཛིན་སྐྱོང་ལྟེ་བའི་ ཡིག་ཚང་ནང་ ནང་སྐོར་རྒཔོ་གི་དྲུང་
ཡིག་ རྣམ་རྒྱལ་རྡོ་རྗེ་དེ་ རྒྱལ་གཞུང་འཛིན་སྐྱོང་སློབ་ཁང་ (ཨར་ཨའི་ཨེམ) ནང་ལོ་ངོ་ གཅིག་གི་རིང་ རྩིས་ཀྱི་སློབ་སྦྱོང་ལས་ མཐར་འཁྱོལ་མི་འདི་ རྒྱལ་གཞུང་ཞི་གཡོག་ལྷན་
ཚོགས་ཀྱི་ བཀའ་རྒྱ་ཨང་་་་་་་་་་་་་་སྤྱི་ཚེས་་་་་་་་་་་་་་་ཅན་མ་དང་འཁྲིལ་ཏེ་ གཞུང་གཡོག་
སྡེ་རིམ་༡༢ པའི་ནང་ལུ་ རྩིས་འཛིན་པ་འབད་གསར་བསྐོས་འབད་ཡི།</Text>
<Text style={{paddingLeft:10,}}>
    ཁོ་གི་ཟླ་རིམ་དངུལ་ཕོགས་འཐོབ་ཚད་ ༢༠༠༠-༡༥༠-༣༥༠༠ 
    ­­­ལུ་གཏན་འཁེལ་བཟོ་ ཡོདཔ་མ་ཚད་ ལོ་འཁོར་དངུལ་ཕོགས་ ཡར་སེང་འདི་ཡང་ སྤྱི་ཚེས་༡/༧/༢༠༠༧
    ལས་འཐོབ་ནི་ཨིན།
</Text>
<Text style={{paddingLeft:90}}>(རྫོང་བདག།)</Text>
<Text style={{paddingLeft:50}}>གཞལམ་སྒང་རྫོང་ཁག་བདག་སྐྱོང་། </Text>

    </View>
  )
}

export default KajaGuide

const styles = StyleSheet.create({})