import { StyleSheet, Text, View } from 'react-native'
import React from 'react'

const KashoGuide = () => {
  return (
    <View style={{flex:1,padding:10,}}>
      <Text style={{textAlign:'center',color:'blue',fontSize:18,fontWeight:'bold'}}>བཀའ་ཤོག</Text>
      <Text style={{paddingVertical:10,}}>རྫོོང་ཁག་སོོ་སོོའི་་རྫོོང་བདག་དང་རྒཔོོ་སྤྱི་་མི་་ཡོོངས་ལུ། གནད་དོོན་འདི་་ནི་་ རྒྱལ་ཡོོངས་ཚོགས་འདུ་ཆེནན་མོོ་ ཐེངངས་༨༨ 
          པ་འདི་་ སྤྱི་་ལོོ་༢༠༠༧ ཟླ་༦ ཚེས་༣ ལས་ འགོོ་བཙུགས་ཏེ་་ ཉིན་གྲངས་༢༧ གྱི་་རིངང་ལུ་ རྒྱལ་ཁབ་
དང་མི་་སེརར་ཡོོངས་ལུ་ཕན་པའི་་ གྲོོས་གཞི་་ཚུ་རེ་་རེ་་བཞིནན་དུ་ གྲོོས་བསྡུར་འབད་དེ་་ སྤྱི་་ཚེས་༣༠/༦/༢༠༠༧ ལུ་
གྲུབ་འབྲས་ཅན་གྱི་་གྲོོས་ཆོོད་བཏོོན་ཐོོག་ལུ་ གྲོོལ་ཡོོདཔ་ཨིནན། དེ་་གི་་གྲོོས་ཆོོད་ཀྱི་་དེབ་འདྲ་རེ་་ ཁྱེདད་ག་ར་ལུ་བཏང་སྟེ་་
ཡོོད།</Text>
<Text>
    འདི་་འབདཝ་ལས་ རྒྱལ་ཡོོངས་ཚོགས་འདུའི་་སྤྱི་་མི་་ཚུ་གིསས་ གུང་པ་རེ་་རེ་་བཞིནན་དུ་ལུ་ རང་སོོའི་་ཁྱབ་འོོག་
    ལུ་ཡོོད་མི་་ མི་་སེརར་ཡོོངས་ལུ་ རྒྱལ་ཡོོངས་ཚོགས་འདུའི་་གྲོོས་ཆོོད་ཚུ་ ཁ་གསལ་སྦེ་་གོོ་བརྡ་སྤེལལ་ཏེ་་ 
    མི་་སེརར་ག་ར་གིསས་ དྭངས་གསལ་ ཧ་གོོ་ཚུགསཔ་བཟོོ་དགོོཔ་དང་། གྲོོས་ཆོོད་འདི་་ཚུ་ལུ་ མི་་སེརར་དམངས་ཀྱིསས་ དང་ལེནན་དང་ངོོས་ལེནན་
    འབད་ནིའི་དོོན་ལུ་ རྒཔོོ་དང་ རྫོོང་ཁག་སོོ་སོོའི་་རྫོོང་བདག་ཚུ་གིསས་ རྒྱབ་སྐྱོོར་ག་དེ་་དྲག་དྲག་འབད་དགོོཔ་གལ་ཆ
</Text>
<Text style={{paddingVertical:10,}}>
མི་་སེརར་དམངས་ལུ་ གོོ་བརྡ་སྤེལལ་ཡོོད་པའི་་ སྙན་ཞུ་ཚུ་ཡང་ སྤྱི་་མི་་རང་ར་སོོ་སོོ་གིསས་ རྫོོང་བདག་བརྒྱུད་དེ་་
སྤྱི་་ལོོ་༢༠༠༧ གྱི་་སྤྱི་་ཟླ་༧ པའི་་ཚེས་༣༠ འི་་ནང་འཁོོད་ རྒྱལ་ཡོོངས་ཚོགས་འདུ་ཆེནན་མོོའི་་ཡིགག་ཚང་ནང་ 
ངེས་པར་ དུ་བསྐྱལ་དགོོཔ་ཨིནནམ་ སེམས་ཁར་ངེས། ཞེས་རང་ལུགས་གནམ་ལོོ་མེ་་མོོ་ཕག་ལོོ་ ཟླ་ ༥པའི་་ཚེས་༢༡ ལུ།
</Text>
<Text style={{textAlign:'right',paddingRight:15,}}>
(ཚོགས་དཔོན།)
</Text>
<Text style={{textAlign:'right',paddingRight:15,}}>
རྒྱལ་ཡོངས་ཚོགས་འདུ་ཆེན་མ
</Text>
    </View>
  )
}

export default KashoGuide

const styles = StyleSheet.create({})
