import { StyleSheet, Text, ScrollView,View } from 'react-native'
import React from 'react'

const SeldraGuide = () => {
  return (
    <ScrollView style={{paddingVertical:15,}}>
      <Text style={{color:'blue',fontWeight:'bold',fontSize:18,textAlign:'center',paddingBottom:10,}}>གསལ་བསྒྲགས།</Text>
      <Text style={{paddingLeft:10}}>
            གསལ་བསྒྲགས་ཟེརར་མི་་འདི་་ ལྷན་ཁག་དང་ལས་ཁུངས་ ལས་སྡེ་་ཚུ་དང་ སྒེརར་པ་རང་སོོ་གིསས་ མི་་མང་ལུ་
        བརྡ་དོོན་སྤྲོོད་དགོོ་པའི་་གནད་དོོན་གང་རུང་ཅིག་ སོོ་སོོའི་་ དང་འདོོད་དང་འཁྲིལ་ཏེ་་ ངོོས་ལེནན་འབད་ནིའི་་དོོན་
        ལུ་ ཁ་གསལ་བཀོོད་དེ་་གསལ་བསྒྲགས་འབད་མི་་གི་་ཡི་་གུ་ཅིག་ལུ་སླབ་ཨིནན།
      </Text>
      <Text style={{paddingVertical:10,paddingLeft:10,}}>
            གསལ་བསྒྲགས་འདི་་ རང་གི་་དོོན་དག་འགྲུབ་དགོོཔ་ཡོོད་མི་་ཚུ་ མི་་མང་ཡོོངས་ཀྱིསས་ ཧ་གོོ་ཚུགསཔ་ཅིག་དང་
        དང་ལེནན་འབད་ཚུགསཔ་ཅིག་ བཟོོ་ནི་་གི་་དོོན་ལུ་ཨིནནམ་ལས་ གནད་དོོན་ཚུ་ ཆ་ཚང་བ་ དོོན་ཁ་གསལ་བ་
        ཚིག་གོོ་བདེ་་བ་ ཁུངས་བཙན་པ་ གཞན་གྱི་་རྣ་བར་འཛུལ་ཏོོག་ཏོོ་དང་ གཞན་གྱིསས་དེ་་ལུ་ དང་ལེནན་ འབད་ངོོ་ བདེ་་ཏོོག་ཏོོ་ ཡོོདཔ་ཅིག་བྲི་་དགོོཔ་ཨིནན།
      </Text>
      <Text style={{paddingLeft:10,}}>
            དེ་་གི་་དོོན་ལུ་ ལས་ཁུངས་ཁག་སོོ་སོོ་ལས་ གནང་བའི་་གསལ་བསྒྲགས་དཔེ་་དག་པ་ཅིག་ འོོག་ལུ་བཀོོད་དེ་་
            ཡོོད། ཁྱོོད་ཀྱིསས་འདི་་ལས་རིགས་བསྒྲེསས་ཏེ་་ གནད་དོོན་སོོ་སོོའི་་དོོན་ལུ་ གསལ་བསྒྲགས་ཡི་་གུ་བྲི་་ནི་་གི་་སྦྱང་
            བ་འབད་དགོོ།
      </Text>
      <Text style={{paddingVertical:10,paddingLeft:10,color:'blue'}}>རིན་སྡུར་གསལ་བསྒྲགས་ཀྱི་དཔེ།</Text>
      <Text style={{paddingHorizontal:80,textAlign:'center',}}>
      ལམ་སེལ་ལས་ཁུངས། མོང་སྒར་གླིང་མི་ཐང་། ས་ཁོངས་སྡེ་ཚན།
     རིན་སྡུར་གསལ་བསྒྲགས།
      </Text>
      <Text style={{paddingLeft:10,paddingVertical:10,}}>
      དང་འདོད་ཅན་གྱི་བཀྲམ་སྤེལ་བ་ཚུ་གིས་གཤམ་གསལ་ཅ་ཆས་ཚུ་བཀྲམ་སྤེལ་གྱི་གོང་ཚད་ཡི་གུ་ཐིའུ་
      ཅནམ་ཚུ་བཙུགས་གནང་།
      </Text>
    <View style={{flexDirection:'row',padding:10,flexWrap:'wrap'}}>
        <Text style={{paddingHorizontal:20,}}>༡. ཡིག་ཚང་གི་ཡིག་འབྲི་མཁོ་ཆས།</Text>
        <Text style={{paddingHorizontal:20,}}>༢. ཁང་ཆས།</Text>
        <Text style={{paddingHorizontal:20,}}>༣. བཟོ་སྐྲུན་མཁོ་ཆས་བཀྲམ་སྤེལ།</Text>
        <Text style={{paddingHorizontal:20,}}>༤. ཤིང་ཆས་དྲ་དྲཝ་བཀྲམ་སྤེལ།</Text>
        <Text style={{paddingHorizontal:20,}}>༥. ཀམ་པིའུུ་ཊར་དང་འབྲེལ་ཡོོད་མཁོོ་ཆས།</Text>
        <Text style={{paddingRight:20,}}>༦. ཡིགག་ཚང་གི་་ཅ་ཆས།</Text>
    </View>
    <Text style={{paddingLeft:10,paddingVertical:10,}}>
    ལག་ལེནན་ལམ་ལུགས་ཁ་གསལ་ཡོད་པོ འི་་ རིནན་བསྡུར་ཡིགག་ཆ་ཚུ་སྤྱི་་ཚེས་ ༢/༩/༠༦ལས་༣/༡༠/༠༦
ཚུན་ ཡིགག་ཐོོག་ཞུ་ཡིགག་དང་ ཆོོག་ཐམ་གྱི་་འདྲ་རེ་་དང་སྦྲགས་རིནན་འཐུས་དངུལ་ཀྲམ་༥༠༠(ལོོག་མི་་འཐོོབ་)
བཙུགས་ཐོོག་ལས་གླིངང་མི་་ཐང་ ལམ་སེལ་ལས་ཁུངས་ཀྱི་་བཟོོ་རིག་བཀོོད་ཁྱབ་འགོོ་དཔོོན་ཡིགག་ཚང་ནང་
ལས་ཉོོ་ནི་་འཐོོབ། གོོང་ཚད་ཡི་་གུ་ཚུ་སྤྱི་་ཚེས་ ༣/༡༠/༠༦ཉིན་མའི་་ཆུ་ཚོདད་ ༢ ཀྱི་་ནང་འཁོོད་བཙུགས་
དགོོཔ་ཨིནནམ་ད་ དེ་་ཚེ་་རང་ ཉིན་མའི་་ཆུ་ཚོདད་༢.༣༠ལུ་ཁ་ཕྱེ་་ནི་་ཨིནན། རིནན་བསྡུར་ཚོགས་ཆུང་གིསས་གྲོོས་
ཐག་བཅད་མི་་དེ་་ མཐའ་བཅད་ཨིནན་ཟེརར་ཞུ་ནི་་ཨིནན།
    </Text>
    <Text style={{paddingRight:40,textAlign:'right',marginBottom:20,}}>
    བཟོ་རིག་བཀོད་ཁྱབ་འགོ་དཔོན།
    </Text>
    </ScrollView>
  )
}

export default SeldraGuide

const styles = StyleSheet.create({})