import { StyleSheet, Text, View,ScrollView } from 'react-native'
import React from 'react'

const TangyekGuide = () => {
  return (
    <ScrollView  style={styles.container}>
      <Text style={{color:'blue',fontSize:15,fontWeight:'bold',textAlign:'center'}}>གཏང་ཡིག། དེང་རབས་ལམ་ལུགས་ལས་ དོན་མཚམས་ནང་འདྲེན་འབད་དེ་འབྲི་ཐངས་ཀྱི་དཔེ།</Text>
      <Text style={{textAlign:'right',marginTop:10,}}>སྤྱི་ལོ་༡༩༩༨ ཟླ་༦ པའི་ཚེས་༢ ལུ།</Text>
      <View style={{padding:15}}>
          <Text>ངེའི་དྲིན་ཅན་ཨ་པ་ལུ། </Text>
          <Text>མོང་སྒར་རྫོང་ཁག།</Text>
          <Text>ཕའི་སིང་མ།</Text>
      </View>
      <View style={{padding:15}}>
          <Text> ད་རེས་ ཕར་གཡུས་ཁ་ལུ་བཞུགས་མི་ཕམ་གཉིས་དང་ སྤུན་ཆ་ཚུ་ཡང་ལེགས་ཤོམ་སྦེ་ཡོད་པའི་
    རེ་བ་ཡོད། བུཚ་རང་ ལུས་ལུ་ན་ཚ་དང་ སེམས་ལུ་སྡུག་བསྔལ་མེད་པར་ སློབ་གྲྭ་འདི་ནང་འཛོམས་ཏེ་ ཆོས་ཡོན་
    ཏན་ལྷབ་ནི་ལུ་བརྩོན་ཤུགས་སྐྱེད་དོ་ཟེར་ཞུ་ནི་ཨིན། ནཱ་གི་སློབ་དཔོན་ཚུ་ ག་ར་ཡོན་ཏན་ཅན་དང་ བྱམས་སྐྱོང་ཆེ་དྲགས་
    ཙང་ཙ་ཨིན་པའི་ཁར། སློབ་གྲྭའི་དབུ་འཛིན་འདི་ སློབ་ཕྲུག་ཚུ་ལུ་ ཤ་ཚ་ཅན་ཅིག་ཨིན་མས།</Text>

    <Text>སློབ་གྲྭ་འདི་གི་ སློབ་ཁང་དང་ ཡིག་ཚང་ སྤྱི་དོན་ཁང་ ཚན་རིག་ཁང་ སློབ་དཔོན་གྱི་གཟིམ་ཅུང་ ཆབ་གསང་
    ཐབ་ཚང་ཚུ་ ག་ར་དགའ་ཏོག་ཏོ་འདུག། དེ་ལས་ མཐའ་འཁོར་དང་ སློབ་གྲྭའི་ཐང་ཚུ་ ཧོ་ལྡེམ་ལྡེམ་སྦེ་ གོ་
    ཡངས་ཏོག་ཏོ་འདུག། དེ་མ་ཚད་ ཉིན་བསྟར་སློབ་སྟོན་གྱིས་མ་དོ་བར་ སྙན་ཆ་ རིག་རྩལ་གྱི་དྲིས་ལན་ རྩོད་འགྲན་
    ལ་སོགས་པའི་ལས་རིམ་ ལེ་ཤ་འགོ་འདྲེན་འཐབ་ནི་འདུག། དེ་གིས་འབད་ སློབ་གྲྭ་འདི་ དྲག་ཤོས་ཀྱི་ རྟགས་
    མ་ཚུ་ཐོབ་ཡོདཔ་ལས་ ང་ཡང་དཔའ་ངོམ་འབྱུངམ་མས་ཟེར་ཞུ་ནི་ཨིན།</Text>
      </View>
      <Text style={{textAlign:'right'}}>བཀྲིན་ཆེ།</Text>
      <Text style={{textAlign:'right'}}> བརྩེ་བའི་བུ་ཆུང་ཚེ་རིང་ཕུན་ཚོགས།</Text>
      <Text style={{marginTop:10,}}>༊ ཤེས་བྱ་ཀུན་གཟིགས་མི་རྗེ་ཤེས་རིག་བློན་པོ་རིན་པོ་ཆེའི་༢ ཞབས་དྲུང་ལུ།</Text>
      <View style={{padding:15}}>
          <Text>སྒོ་༣ གུས་པས་ཞུ་དོན། སློབ་གྲྭའི་
ཤེས་ཡོན་ལས་ཁུངས་ཀྱི་འོག་ལུ་ཡོད་པའི་ ཤེས་ཡོན་རྩ་གཞུང་དང་ཁྱད་རིག་རྒྱབ་སྐྱོར་སྡེ་ཚན་གྱིས་ ཤེས་
རིག་སྲིད་བྱུས་དང་རྒྱལ་ཁབ་ཡར་རྒྱས་ཀྱི་འགྱུར་བ་དང་བསྟུན་ཏེ་ སློབ་རིམ་༡༢ པའི་རྫོང་ཁའི་ཤེས་ཡོན་གྱི་
གནས་ཚད་ཚུ་ གསར་བཀོད་འབད་དེ་ཆ་འཇོག་གྲུབ་ཡོདཔ་ཨིན།</Text>

    <Text>གནས་ཚད་དེ་དང་འཁྲིལ་ཏེ་ བློ་གསར་ལས་སློབ་རིམ་༡༢ པ་ཚུན་གྱི་ རྩ་གཞུང་བཀོད་རིས་དང་ ཆོས་ཚན་
དཔེ་དེབ་ཚུ་ ལེགས་སྒྱུར་དང་གསར་རྩོམ་འབད་དགོཔ་ཐོན་ཡི། དེ་ནང་ལས་ སློབ་རིམ་༩ པ་ལས་ སློབ་
རིམ་༡༢ པ་ཚུན་གྱི་ ཆོས་ཚན་དཔེ་དེབ་རྩོམ་འབྲིའི་གོ་སྡུར་ཞལ་འཛོམས་འདི་ སྤྱི་ལོ་༢༠༠༦ ཟླ་༧ པའི་
ཚེས་༢ ལས་ སྤྱི་ལོ་༢༠༠༦ ཟླ་༨ པའི་ཚེས་༢༡ ཚུན་ འགོ་འདྲེན་འཐབ་ནིའི་ལས་རིམ་བཟོ་སྟེ་ཡོད།
</Text>

<Text>འདི་འབདཝ་ལས་ རྫོང་ཁའི་དཔེ་དེབ་རྩོམ་འབྲིའི་ཞལ་འཛོམས་འདི་ གྲུབ་འབྲས་ཅན་དང་ འོས་འབབ་
ཅན་འབད་བཟོ་ཚུགས་ནིའི་དོན་ལུ་ དེ་ནང་འཛོམ་མི་རྩོམ་འབྲིཔ་ཤེས་རིག་མཁས་མཆོག་ཚུ་ལུ་ མི་རྗེ་བློན་
པོ་མཆོག་གིས་ འབྲུག་གི་ཤེས་རིག་སྲིད་བྱུས་དང་འཁྲིལ་བའི་ མ་འོངས་རྫོང་ཁའི་ཤེས་ཡོན་གྱི་མདུན་ལམ་
ཞལ་བཀོད་ཀྱི་ བཀའ་སློབ་ཚུ་གནང་ནི་དང་། 
</Text>
<Text>ྷག་པར་ འགོ་འབྱེད་རྟེན་འབྲེལ་སྐབས་ལུ་ ཕུན་སུམ་ཚོགས་པའི་བཀྲ་ཤིས་ལེགས་སྨོན་གནང་ནིའི་དོན་ལུ་ 
ས་གནས་ ---མགྲོན་ཁྱིམ་གྱི་ཞལ་འཛོམས་ཁང་ནང་ ལས་རིམ་ཟུར་སྦྲགས་ སྤྱན་འབུལ་ཕུལ་ཡོད་མི་དང་
འཁྲིལ་ཏེ་ སྤྱི་ལོ་༢༠༠༦ ཟླ་༧ པའི་ཚེས་༢ དྲོ་པ་ཆུ་ཚོད་༩.༣༠ ལུ་ འབྱོན་གནང་ཐུབ་ཞུ་བ་ མཁྱཻན་མཁྱེན་
ལགས། ཞེས་སྤྱི་ལོ་༢༠༠༦ ཟླ་༦ ཚེས་༢༥ ལུ་ གུས་པའི་
</Text>
      </View>
      <Text style={{textAlign:'right'}}>བཀྲིན་ཆེ།</Text>
      <Text style={{textAlign:'right',marginBottom:10,}}>ྩ་གཞུང་དང་ཁྱད་རིག་རྒྱབ་སྐྱོར་སྡེ་ཚན།</Text>
    </ScrollView>
  )
}

export default TangyekGuide

const styles = StyleSheet.create({
    container:{
        flex:1,
        padding:10,
    }
})