import { StyleSheet, Text, View ,ScrollView} from 'react-native'
import React from 'react'

const ZhuyekGuide = () => {
  return (
    <ScrollView style={{marginBottom:10,}}>
        <Text style={{color:'blue',textAlign:'center',padding:10,fontSize:18,fontWeight:'bold'}}>ཞུ་ཚིག་/བཤེར་ཡིག</Text>
                <Text style={{padding:10}}>ཞུ་ཚིག་ཟེར་མི་འདི་ སླབ་གཞི་རྩོད་གཞི་དབྱེ་བཤེར་འབད་ནི་གི་དོན་ལུ་ འབྲིཝ་ཨིནམ་ལས་ དེ་ལུ་བཤེར་ཡིག་
          ཟེར་ཡང་སླབ་ཨིན། བཤེར་ཡིག་འདི་ལུ་ མི་ཁུངས་ངོ་སྤྲོད་ལག་ཁྱེར་ཨང་དང་ ཁྲིམས་རྟགས་འདི་ ཨིན་ཅི་
          མིན་ཅི་དགོ། ཞུ་ཚིག/བཤེར་ཡིག་འབྲིཝ་ད་ཡང་ ཚིག་དོན་ཚུ་ ག་དེ་དྲག་དྲག་ གོ་བ་ཁ་གསལ་ཏོག་ཏོ་དང་
          ཚིག་ཉུང་སུ་ གནད་དོན་དེ་ཚུ་ གོ་རིམ་ལེགས་ཤོམ་འབད་ བསྒྲིགས་ཞིན་ན་ རྒྱབ་ཁུངས་དང་སྦྲགས་ཏེ་ ཁ་
          གསལ་བཀོད་དགོ།</Text>
          <Text style={{padding:10}}>
          ཤེར་ཡིག/ཞུ་ཚིག་གི་ དོན་ཚན་གོ་རིམ་ཚུ་ འོག་ལུ་བཀོད་ཡོད་མི་དང་འཁྲིལ་ཏེ་བྲི་བ་ཅིན་ ལམ་ལུགས་ཤོ་ 
          མཚུངས་འགྱོཝ་མ་ཚད་ བཤེར་ཡིག་ལྷག་མི་གིས་ཡང་ ཧ་གོཝ་འཇམ་ཏོང་ཏོ་འོང་། དེ་མ་ཚད་ ཞུ་ཚིག/
          བཤེར་ཡིག་ཚུ་ སྔར་སྲོལ་ལམ་ལུགས་ཀྱི་ ཞུ་ཡིག་འབྲི་ཐངས་ལམ་ལུགས་དང་ འཁྲིལ་ཏེ་བྲི་དགོཔ་ཨིན།
          </Text>
          <Text style={{paddingLeft:10,color:'blue',paddingBottom:5}}>
          སྔར་སྲོལ་ལམ་ལུགས་ཀྱི་ ཞུ་ཚིག་གམ་ བཤེར་ཡིག་གི་དཔེ།
          </Text>
          <Text style={{paddingLeft:10}}>
          ༊  ལེགས་ཉེས་ཁྲིམས་ཀྱི་ཤན་འབྱེད་ སྤ་རོ་རྫོང་ཁག་ཁྲིམས་ཀྱི་འདུན་སའི་ དྲགོས་དྲང་དཔོན་མཆོག་གི་དྲུང་དུ།
         </Text>
         <Text style={{textAlign:'right',paddingRight:4,}}>
          གུས་ཀྲོང་གསར་ཆ་འས་བ་ས་ད་འོག་ གས་དཀར་གཞོང་ལས་ 
         </Text>
         <Text style={{paddingLeft:10,}}>
          ངོ་མིང་དར་ ངོ་ད་ལག་ཁྱེར་ཨང་
          ༠༥༤༧༨༨༩ ཅན་མ་གིས་ ་དོན། གུས་རང་ མ་ཐང་ང་ལས་ ཨཔ་དོན་གྲུབ་ཀྱི་ པ་
          སངས་དང་གཅིག་ཁར་ གཉེན་གྲོགས་བམས་ཏེ་ ལོ་ངོ་གཅིག་སོང་བའི་ལ་ ཁོ་གིས་ ཨམ་
          གཞན་མི་ཅིག་བན་ཆིཝ་ལས་ ང་བཅས་བཟའ་མི་གཉིས་ མ་འགྲིགསཔ ང་ཡོད་ལགས།
          </Text>
          <Text style={{paddingLeft:10,paddingTop:10,paddingBottom:10}}>
          དེ་ཡང་ རང་བ་གྲྭ་ནང་དཔེ་ཆ་བ་འ་ལས་ ཁོ་དང་གཅིག་ཁར་གཉེན་བ་གེ་ཟེར་ ངེ་གི་ཨ་པ་
          དང་ཨའི་ བན་གྲོས་འཚོལ་ཏེ་ ཐོན་འོངམ་ལས་ ཁོང་ཕམ་གཉིས་པོ་མི་གནགཔ་ཨིན་པའི་ཁར་ 
          རང་ ཨམ་འི་སེམས་འབདཝ་ལས་ ཁོ་དང་གཅིག་ཁར་གཉེན་བམས་ཏེ་ ལོ་ངོ་གཅིག་
          ཀྲིག་ཀྲི་འཁོར་སོ་ཡི། 
          </Text>
          <Text style={{paddingLeft:10,paddingBottom:10,}}>
          ད་རེས་འབདཝ་ད་ ཁོ་གིས་ཨམ་གཞན་མི་གཅིག་བན་ཏེ་ ཁྱིམ་ནང་་ལས་ལོག་འོང་མ་བབ་
          ལས་ ཁྐྲིམས་ཀྱི་འན་ས་ མ་བཅར་ཐབས་མེད་སོང་ཡོད། དེ་ཡང་ དང་པ་་ ང་ར་ བ་གྲྭ་
          ནང་དཔེ་ཆ་བ་འ་ལས་ ཁོ་གིས་གཉེན་བ་གེ་ཟེར་ བ་རིམ་༡༡ པ་ལས་ འ་མད་མ་
          གས་པའི་ཁར། གཉིས་པ་་ གགས་་ཁོག་ཐལ་ཏེ་ ་ངོ་༣ དེ་ཅིག་ཡར་སོ་ཡི་ལགས།
          </Text>
          <Text style={{paddingLeft:10,paddingBottom:10}}>
          ཁོ་གིས་ གསོ་བ་ན་ས་འབད་ བད་ཅན་གྱི་བཞེས་ ན་ནི་ཕར་ར་བཞག་ རང་གི་ཕམ་དང་
          ན་ཆ་གིས་ ལེགས་ཤོམ་འབད་བཤད་དེ་བ་ང་ ཡ་འབད་མ་བབ་མ་ཚད་ ངེ་གི་ཨ་པ་་ཡང་ 
          ལགཔ་བཀལ་ནིའི་ས་ བ་ཡོདཔ་ལས་ ང་ཁྐྲིམས་མ ་ཐབས་མེད་ཡར་སོང་ཡི།
          </Text >
          <Text style={{paddingLeft:10,paddingBottom:10}}>
          འདི་འབདཝ་ལས་ གོས་ང་དཔོན་མཆོག་གིས་ ད་ཞིབ་མཛད་དེ་ ང་བདེན་མཐའ་གསལ་གྱི་
        བཀའ་ལན་ཅིག་ གང་མགྱོགས་གནང་་ བཀའ་ན་བང་གནང་ཟེར་ ་བ་མཁྱེན་མཁྱེན་མཁྱེན་
        ལགས། རང་གས་གནམ་ལོ་ ས་མོ་ཡོས་ལོ་་༥ པའི་ཚེས་༣ ལ་
        </Text>
        <Text style={{paddingRight:50,textAlign:'right'}}>ཕུལ།</Text>
    </ScrollView>
  )
}

export default ZhuyekGuide

const styles = StyleSheet.create({})